#pragma once

#include "Smooth.h"



const long n_mass_storage = 5000000;
const int cnst_wind_flt = 128;
const int cnst_wind_dbl = 128;

void run(){
    
    //------------------------------------------------------------------------------
    // Инициализация
    //------------------------------------------------------------------------------
    double* Arr1;
    Arr1 = new double[n_mass_storage]; // динамический массив вход
    srand(time(NULL));
    double num;

    double* Arr2;
    Arr2 = new double[n_mass_storage]; // динамический массив выход

    float* Arr1_f;
    Arr1_f = new float[n_mass_storage]; // динамический массив вход
    srand(time(NULL));
    float num1;

    float* Arr2_f;
    Arr2_f = new float[n_mass_storage]; // динамический массив выход

    //------------------------------------------------------------------------------
    // Заполнение
    //------------------------------------------------------------------------------

    for (int i = 0; i < n_mass_storage; i++)
    {
        num = rand() % 200 + 1;         // случайные числа от 0 до 20
        Arr1[i] = num;
        num1 = rand() % 200 + 1;        // случайные числа от 0 до 20
        Arr1_f[i] = num1;
    }

    //------------------------------------------------------------------------------
    // Вызов Функции
    //------------------------------------------------------------------------------       

    for (int i = 4; i < 129; i *= 2)
    {
        time_measuring(Arr1, Arr2, n_mass_storage, i);
    }
    std::cout << "_________" << std::endl;
    for (int i = 4; i < 129; i *= 2)
    {
        time_measuring(Arr1_f, Arr2_f, n_mass_storage, i);
    }


    //------------------------------------------------------------------------------
    //Деструктор
    //------------------------------------------------------------------------------
    delete[]Arr1;
    delete[]Arr2;
    //------------------------------------------------------------------------------
}